js216/stm32mp135-bootloader/src/ctp.c
// SPDX-License-Identifier: BSD-3-Clause

/**
 * @file ctp.c
 * @brief CTP touch control.
 * @author Jakob Kastelic
 * @copyright 2026 Stanford Research Systems, Inc.
 */

#include "ctp.h"
#include "stm32mp13xx_hal_i2c.h"
#include "stm32mp13xx_hal_gpio.h"
#include "stm32mp13xx_hal_rcc.h"
#include "printf.h"
#include <string.h>

#define CTP_I2C_ADDRESS    0x5D
#define CTP_TOUCH_DATA_LEN 41
#define CTP_REG_ID         0x8140
#define CTP_REG_STATUS     0x814E

#define TOUCH_POINT_GET_NUM(T) ((T) & 0x0F)
#define TOUCH_POINT_GET_X(T)   (((T).XH << 8) | (T).XL)
#define TOUCH_POINT_GET_Y(T)   (((T).YH << 8) | (T).YL)

#define CTP_INT_PORT GPIOH
#define CTP_INT_PIN  GPIO_PIN_12
#define CTP_SCL_PORT GPIOH
#define CTP_SCL_PIN  GPIO_PIN_13
#define CTP_SDA_PORT GPIOF
#define CTP_SDA_PIN  GPIO_PIN_3
#define CTP_AF       GPIO_AF4_I2C5

struct ctp_touch_point {
    uint8_t TRACK_ID;
    uint8_t XL;
    uint8_t XH;
    uint8_t YL;
    uint8_t YH;
    uint8_t SL;
    uint8_t SH;
    uint8_t RESERVED;
};

struct ctp_touch_data {
    uint8_t STATUS;
    struct ctp_touch_point TOUCH[5];
};

// global variables
extern I2C_HandleTypeDef hi2c5;
static uint8_t touch_buf[CTP_TOUCH_DATA_LEN];
static int last_x = -1;
static int last_y = -1;

static void ctp_pin_setup(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    // INT pin input
    GPIO_InitStruct.Pin = CTP_INT_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(CTP_INT_PORT, &GPIO_InitStruct);

    // SCL pin AF4 open-drain
    GPIO_InitStruct.Pin = CTP_SCL_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    GPIO_InitStruct.Alternate = CTP_AF;
    HAL_GPIO_Init(CTP_SCL_PORT, &GPIO_InitStruct);

    // SDA pin AF4 open-drain
    GPIO_InitStruct.Pin = CTP_SDA_PIN;
    HAL_GPIO_Init(CTP_SDA_PORT, &GPIO_InitStruct);
}

static int ctp_read_touch(void)
{
    HAL_StatusTypeDef ret;
    uint8_t zero = 0;

    // read touch data directly from STATUS register
    ret = HAL_I2C_Mem_Read(&hi2c5,
                           CTP_I2C_ADDRESS << 1,
                           CTP_REG_STATUS,
                           I2C_MEMADD_SIZE_16BIT,
                           touch_buf,
                           CTP_TOUCH_DATA_LEN,
                           100);
    if (ret != HAL_OK) {
        my_printf("CTP error: read touch data failed\n");
        return -1;
    }

    struct ctp_touch_data *data = (struct ctp_touch_data *)touch_buf;
    if (!((data->STATUS & 0x80) >> 7)) {
        return 0;
    }

    // clear status byte
    ret = HAL_I2C_Mem_Write(&hi2c5,
                            CTP_I2C_ADDRESS << 1,
                            CTP_REG_STATUS,
                            I2C_MEMADD_SIZE_16BIT,
                            &zero,
                            1,
                            100);
    if (ret != HAL_OK) {
        my_printf("CTP error: clear STATUS failed\n");
        return -1;
    }

    return 1;
}

void ctp_init(void)
{
    HAL_StatusTypeDef ret;

    ctp_pin_setup();  // configure clocks + GPIOs

    // enable I2C5 clock
    __HAL_RCC_I2C5_CLK_ENABLE();

    // initialize hi2c5
    hi2c5.Instance = I2C5;
    hi2c5.Init.Timing = 0x0010061A; // example value for 400 kHz @16MHz
    hi2c5.Init.OwnAddress1 = 0;
    hi2c5.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c5.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c5.Init.OwnAddress2 = 0;
    hi2c5.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c5.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c5.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

    ret = HAL_I2C_Init(&hi2c5);
    if (ret != HAL_OK) {
        my_printf("CTP init failed: HAL_I2C_Init() failed\n");
        return;
    }

    // read device ID
    ret = HAL_I2C_Mem_Read(&hi2c5,
                           CTP_I2C_ADDRESS << 1,
                           CTP_REG_ID,
                           I2C_MEMADD_SIZE_16BIT,
                           touch_buf,
                           3,
                           100);
    if (ret != HAL_OK) {
        my_printf("CTP init failed: read ID failed\n");
        return;
    }

    if (touch_buf[0] != '9' || touch_buf[1] != '1' || touch_buf[2] != '1') {
        my_printf("CTP init failed: bad ID %c%c%c\n", touch_buf[0], touch_buf[1], touch_buf[2]);
        return;
    }

    my_printf("CTP init OK\n");
}


void ctp_print_last_touch(void)
{
    int ret = ctp_read_touch();
    if (ret < 0) return;
    if (ret == 0) {
        my_printf("CTP: no touch\n");
        last_x = last_y = -1;
        return;
    }

    struct ctp_touch_data *data = (struct ctp_touch_data *)touch_buf;
    int num = TOUCH_POINT_GET_NUM(data->STATUS);
    if (num == 0) {
        my_printf("CTP: no touch\n");
        last_x = last_y = -1;
        return;
    }

    last_x = TOUCH_POINT_GET_X(data->TOUCH[0]);
    last_y = TOUCH_POINT_GET_Y(data->TOUCH[0]);
    my_printf("CTP: touch #%d at (%d,%d)\n", 1, last_x, last_y);
}

